Output from Terraform plan
```[command]/home/runner/work/_temp/374fa809-2459-4b20-a641-3c095ea53b88/terraform-bin plan -refresh=false -no-color -out=plan
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.automation_account["t2-oasys"].azurerm_automation_account.automation_account will be created
  + resource "azurerm_automation_account" "automation_account" {
      + dsc_primary_access_key   = (known after apply)
      + dsc_secondary_access_key = (known after apply)
      + dsc_server_endpoint      = (known after apply)
      + id                       = (known after apply)
      + location                 = "ukwest"
      + name                     = "t2-oasys-automation-account"
      + resource_group_name      = "t2-oasys"
      + sku_name                 = "Basic"
    }

  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["0"] will be created
  + resource "azurerm_automation_job_schedule" "job_schedules" {
      + automation_account_name = "t2-oasys-automation-account"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + resource_group_name     = "t2-oasys"
      + runbook_name            = "start-vms"
      + schedule_name           = "weekdays 7am"
    }

  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["1"] will be created
  + resource "azurerm_automation_job_schedule" "job_schedules" {
      + automation_account_name = "t2-oasys-automation-account"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + resource_group_name     = "t2-oasys"
      + runbook_name            = "stop-vms"
      + schedule_name           = "weekdays 7pm"
    }

  # module.automation_account["t2-oasys"].azurerm_automation_module.azurerm will be created
  + resource "azurerm_automation_module" "azurerm" {
      + automation_account_name = "t2-oasys-automation-account"
      + id                      = (known after apply)
      + name                    = "AzureRM"
      + resource_group_name     = "t2-oasys"

      + module_link {
          + uri = "https://www.powershellgallery.com/api/v2/package/AzureRM/6.13.2"
        }
    }

  # module.automation_account["t2-oasys"].azurerm_automation_runbook.runbooks["start-vms"] will be created
  + resource "azurerm_automation_runbook" "runbooks" {
      + automation_account_name = "t2-oasys-automation-account"
      + content                 = <<-EOT
            workflow start-vms
            {
                # vars
                $$resourceGroup  = t2-oasys
                
                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation
                Connect-AzureRMAccount -Identity
            
                # get vm list
                $$azureVMs = (Get-AzureRmVM -ResourceGroupName $$resourceGroup).Name 
                [System.Collections.ArrayList]$$azureVMsToHandle = $$azureVMs 
            
                # iterate over vms
                foreach -parallel ($$azureVM in $$azureVMsToHandle) 
                { 
                    # start vm
                    Start-AzureRmVM -ResourceGroupName $$resourceGroup -Name $$azureVM
            
                    # update monitoring tag
                    $$tags  = (Get-AzureRmResource -ResourceGroupName $$resourceGroup -Name $$azureVM).Tags
                    $$new_tags = InlineScript {
                        $$new_tags = @()
                        $$tags = $$Using:tags
                        foreach($$item in $$tags) {
                            if ($$item.Name -eq "not_monitored") {
                                $$new_tags += @{"Name"="not_monitored";"Value"="false"}
                            } else {
                                $$new_tags += @{"Name"=$$item.Name;"Value"=$$item.Value}
                            }
                        }
                        return $$new_tags
                    }
                    Set-AzureRmResource -ResourceGroupName $$resourceGroup -Name $$azureVM -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $$new_tags -Force 
                }
            }
        EOT
      + id                      = (known after apply)
      + job_schedule            = (known after apply)
      + location                = "ukwest"
      + log_progress            = true
      + log_verbose             = true
      + name                    = "start-vms"
      + resource_group_name     = "t2-oasys"
      + runbook_type            = "PowerShellWorkflow"
    }

  # module.automation_account["t2-oasys"].azurerm_automation_runbook.runbooks["stop-vms"] will be created
  + resource "azurerm_automation_runbook" "runbooks" {
      + automation_account_name = "t2-oasys-automation-account"
      + content                 = <<-EOT
            workflow stop-vms
            {
                # vars
                $$resourceGroup  = t2-oasys
                
                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation
                Connect-AzureRMAccount -Identity
            
                # get vm list
                $$azureVMs = (Get-AzureRmVM -ResourceGroupName $$resourceGroup).Name 
                [System.Collections.ArrayList]$$azureVMsToHandle = $$azureVMs 
            
                # iterate over vms
                foreach -parallel ($$azureVM in $$azureVMsToHandle) 
                {
                    # update monitoring tag if it exists
                    $$tags  = (Get-AzureRmResource -ResourceGroupName $$resourceGroup -Name $$azureVM).Tags
                    $$new_tags = InlineScript {
                        $$new_tags = @()
                        $$tags = $$Using:tags
                        foreach($$item in $$tags) {
                            if ($$item.Name -eq "not_monitored") {
                                $$new_tags += @{"Name"="not_monitored";"Value"="true"}
                            } else {
                                $$new_tags += @{"Name"=$$item.Name;"Value"=$$item.Value}
                            }
                        }
                        return $$new_tags
                    }
                    Set-AzureRmResource -ResourceGroupName $$resourceGroup -Name $$azureVM -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $$new_tags -Force 
            
                    # stop vm
                    Stop-AzureRmVM -ResourceGroupName $$ResourceGroup -Name $$azureVM -Force
                }
            }
        EOT
      + id                      = (known after apply)
      + job_schedule            = (known after apply)
      + location                = "ukwest"
      + log_progress            = true
      + log_verbose             = true
      + name                    = "stop-vms"
      + resource_group_name     = "t2-oasys"
      + runbook_type            = "PowerShellWorkflow"
    }

  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 7am"] will be created
  + resource "azurerm_automation_schedule" "schedules" {
      + automation_account_name = "t2-oasys-automation-account"
      + expiry_time             = (known after apply)
      + frequency               = "Week"
      + id                      = (known after apply)
      + interval                = (known after apply)
      + name                    = "weekdays 7am"
      + resource_group_name     = "t2-oasys"
      + start_time              = "2021-07-19T07:00:00Z"
      + timezone                = "UTC"
      + week_days               = [
          + "Friday",
          + "Monday",
          + "Thursday",
          + "Tuesday",
          + "Wednesday",
        ]
    }

  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 7pm"] will be created
  + resource "azurerm_automation_schedule" "schedules" {
      + automation_account_name = "t2-oasys-automation-account"
      + expiry_time             = (known after apply)
      + frequency               = "Week"
      + id                      = (known after apply)
      + interval                = (known after apply)
      + name                    = "weekdays 7pm"
      + resource_group_name     = "t2-oasys"
      + start_time              = "2021-07-16T19:00:00Z"
      + timezone                = "UTC"
      + week_days               = [
          + "Friday",
          + "Monday",
          + "Thursday",
          + "Tuesday",
          + "Wednesday",
        ]
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan"
Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 0.
::debug::stdout: Acquiring state lock. This may take a few moments...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_account.automation_account will be created%0A  + resource "azurerm_automation_account" "automation_account" {%0A      + dsc_primary_access_key   = (known after apply)%0A      + dsc_secondary_access_key = (known after apply)%0A      + dsc_server_endpoint      = (known after apply)%0A      + id                       = (known after apply)%0A      + location                 = "ukwest"%0A      + name                     = "t2-oasys-automation-account"%0A      + resource_group_name      = "t2-oasys"%0A      + sku_name                 = "Basic"%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["0"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "t2-oasys"%0A      + runbook_name            = "start-vms"%0A      + schedule_name           = "weekdays 7am"%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["1"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "t2-oasys"%0A      + runbook_name            = "stop-vms"%0A      + schedule_name           = "weekdays 7pm"%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_module.azurerm will be created%0A  + resource "azurerm_automation_module" "azurerm" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + id                      = (known after apply)%0A      + name                    = "AzureRM"%0A      + resource_group_name     = "t2-oasys"%0A%0A      + module_link {%0A          + uri = "https://www.powershellgallery.com/api/v2/package/AzureRM/6.13.2"%0A        }%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_runbook.runbooks["start-vms"] will be created%0A  + resource "azurerm_automation_runbook" "runbooks" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + content                 = <<-EOT%0A            workflow start-vms%0A            {%0A                # vars%0A                $$resourceGroup  = t2-oasys%0A                %0A                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation%0A                Connect-AzureRMAccount -Identity%0A            %0A                # get vm list%0A                $$azureVMs = (Get-AzureRmVM -ResourceGroupName $$resourceGroup).Name %0A                [System.Collections.ArrayList]$$azureVMsToHandle = $$azureVMs %0A            %0A                # iterate over vms%0A                foreach -parallel ($$azureVM in $$azureVMsToHandle) %0A                { %0A                    # start vm%0A                    Start-AzureRmVM -ResourceGroupName $$resourceGroup -Name $$azureVM%0A            %0A                    # update monitoring tag%0A                    $$tags  = (Get-AzureRmResource -ResourceGroupName $$resourceGroup -Name $$azureVM).Tags%0A                    $$new_tags = InlineScript {%0A                        $$new_tags = @()%0A                        $$tags = $$Using:tags%0A                        foreach($$item in $$tags) {%0A                            if ($$item.Name -eq "not_monitored") {%0A                                $$new_tags += @{"Name"="not_monitored";"Value"="false"}%0A                            } else {%0A                                $$new_tags += @{"Name"=$$item.Name;"Value"=$$item.Value}%0A                            }%0A                        }%0A                        return $$new_tags%0A                    }%0A                    Set-AzureRmResource -ResourceGroupName $$resourceGroup -Name $$azureVM -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $$new_tags -Force %0A                }%0A            }%0A        EOT%0A      + id                      = (known after apply)%0A      + job_schedule            = (known after apply)%0A      + location                = "ukwest"%0A      + log_progress            = true%0A      + log_verbose             = true%0A      + name                    = "start-vms"%0A      + resource_group_name     = "t2-oasys"%0A      + runbook_type            = "PowerShellWorkflow"%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_runbook.runbooks["stop-vms"] will be created%0A  + resource "azurerm_automation_runbook" "runbooks" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + content                 = <<-EOT%0A            workflow stop-vms%0A            {%0A                # vars%0A                $$resourceGroup  = t2-oasys%0A                %0A                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation%0A                Connect-AzureRMAccount -Identity%0A            %0A                # get vm list%0A                $$azureVMs = (Get-AzureRmVM -ResourceGroupName $$resourceGroup).Name %0A                [System.Collections.ArrayList]$$azureVMsToHandle = $$azureVMs %0A            %0A                # iterate over vms%0A                foreach -parallel ($$azureVM in $$azureVMsToHandle) %0A                {%0A                    # update monitoring tag if it exists%0A                    $$tags  = (Get-AzureRmResource -ResourceGroupName $$resourceGroup -Name $$azureVM).Tags%0A                    $$new_tags = InlineScript {%0A                        $$new_tags = @()%0A                        $$tags = $$Using:tags%0A                        foreach($$item in $$tags) {%0A                            if ($$item.Name -eq "not_monitored") {%0A                                $$new_tags += @{"Name"="not_monitored";"Value"="true"}%0A                            } else {%0A                                $$new_tags += @{"Name"=$$item.Name;"Value"=$$item.Value}%0A                            }%0A                        }%0A                        return $$new_tags%0A                    }%0A                    Set-AzureRmResource -ResourceGroupName $$resourceGroup -Name $$azureVM -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $$new_tags -Force %0A            %0A                    # stop vm%0A                    Stop-AzureRmVM -ResourceGroupName $$ResourceGroup -Name $$azureVM -Force%0A                }%0A            }%0A        EOT%0A      + id                      = (known after apply)%0A      + job_schedule            = (known after apply)%0A      + location                = "ukwest"%0A      + log_progress            = true%0A      + log_verbose             = true%0A      + name                    = "stop-vms"%0A      + resource_group_name     = "t2-oasys"%0A      + runbook_type            = "PowerShellWorkflow"%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 7am"] will be created%0A  + resource "azurerm_automation_schedule" "schedules" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + expiry_time             = (known after apply)%0A      + frequency               = "Week"%0A      + id                      = (known after apply)%0A      + interval                = (known after apply)%0A      + name                    = "weekdays 7am"%0A      + resource_group_name     = "t2-oasys"%0A      + start_time              = "2021-07-19T07:00:00Z"%0A      + timezone                = "UTC"%0A      + week_days               = [%0A          + "Friday",%0A          + "Monday",%0A          + "Thursday",%0A          + "Tuesday",%0A          + "Wednesday",%0A        ]%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 7pm"] will be created%0A  + resource "azurerm_automation_schedule" "schedules" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + expiry_time             = (known after apply)%0A      + frequency               = "Week"%0A      + id                      = (known after apply)%0A      + interval                = (known after apply)%0A      + name                    = "weekdays 7pm"%0A      + resource_group_name     = "t2-oasys"%0A      + start_time              = "2021-07-16T19:00:00Z"%0A      + timezone                = "UTC"%0A      + week_days               = [%0A          + "Friday",%0A          + "Monday",%0A          + "Thursday",%0A          + "Tuesday",%0A          + "Wednesday",%0A        ]%0A    }%0A%0APlan: 8 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan"%0AReleasing state lock. This may take a few moments...%0A
::debug::stderr: 
::debug::exitcode: 0
::set-output name=stdout::Acquiring state lock. This may take a few moments...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_account.automation_account will be created%0A  + resource "azurerm_automation_account" "automation_account" {%0A      + dsc_primary_access_key   = (known after apply)%0A      + dsc_secondary_access_key = (known after apply)%0A      + dsc_server_endpoint      = (known after apply)%0A      + id                       = (known after apply)%0A      + location                 = "ukwest"%0A      + name                     = "t2-oasys-automation-account"%0A      + resource_group_name      = "t2-oasys"%0A      + sku_name                 = "Basic"%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["0"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "t2-oasys"%0A      + runbook_name            = "start-vms"%0A      + schedule_name           = "weekdays 7am"%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["1"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "t2-oasys"%0A      + runbook_name            = "stop-vms"%0A      + schedule_name           = "weekdays 7pm"%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_module.azurerm will be created%0A  + resource "azurerm_automation_module" "azurerm" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + id                      = (known after apply)%0A      + name                    = "AzureRM"%0A      + resource_group_name     = "t2-oasys"%0A%0A      + module_link {%0A          + uri = "https://www.powershellgallery.com/api/v2/package/AzureRM/6.13.2"%0A        }%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_runbook.runbooks["start-vms"] will be created%0A  + resource "azurerm_automation_runbook" "runbooks" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + content                 = <<-EOT%0A            workflow start-vms%0A            {%0A                # vars%0A                $$resourceGroup  = t2-oasys%0A                %0A                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation%0A                Connect-AzureRMAccount -Identity%0A            %0A                # get vm list%0A                $$azureVMs = (Get-AzureRmVM -ResourceGroupName $$resourceGroup).Name %0A                [System.Collections.ArrayList]$$azureVMsToHandle = $$azureVMs %0A            %0A                # iterate over vms%0A                foreach -parallel ($$azureVM in $$azureVMsToHandle) %0A                { %0A                    # start vm%0A                    Start-AzureRmVM -ResourceGroupName $$resourceGroup -Name $$azureVM%0A            %0A                    # update monitoring tag%0A                    $$tags  = (Get-AzureRmResource -ResourceGroupName $$resourceGroup -Name $$azureVM).Tags%0A                    $$new_tags = InlineScript {%0A                        $$new_tags = @()%0A                        $$tags = $$Using:tags%0A                        foreach($$item in $$tags) {%0A                            if ($$item.Name -eq "not_monitored") {%0A                                $$new_tags += @{"Name"="not_monitored";"Value"="false"}%0A                            } else {%0A                                $$new_tags += @{"Name"=$$item.Name;"Value"=$$item.Value}%0A                            }%0A                        }%0A                        return $$new_tags%0A                    }%0A                    Set-AzureRmResource -ResourceGroupName $$resourceGroup -Name $$azureVM -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $$new_tags -Force %0A                }%0A            }%0A        EOT%0A      + id                      = (known after apply)%0A      + job_schedule            = (known after apply)%0A      + location                = "ukwest"%0A      + log_progress            = true%0A      + log_verbose             = true%0A      + name                    = "start-vms"%0A      + resource_group_name     = "t2-oasys"%0A      + runbook_type            = "PowerShellWorkflow"%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_runbook.runbooks["stop-vms"] will be created%0A  + resource "azurerm_automation_runbook" "runbooks" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + content                 = <<-EOT%0A            workflow stop-vms%0A            {%0A                # vars%0A                $$resourceGroup  = t2-oasys%0A                %0A                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation%0A                Connect-AzureRMAccount -Identity%0A            %0A                # get vm list%0A                $$azureVMs = (Get-AzureRmVM -ResourceGroupName $$resourceGroup).Name %0A                [System.Collections.ArrayList]$$azureVMsToHandle = $$azureVMs %0A            %0A                # iterate over vms%0A                foreach -parallel ($$azureVM in $$azureVMsToHandle) %0A                {%0A                    # update monitoring tag if it exists%0A                    $$tags  = (Get-AzureRmResource -ResourceGroupName $$resourceGroup -Name $$azureVM).Tags%0A                    $$new_tags = InlineScript {%0A                        $$new_tags = @()%0A                        $$tags = $$Using:tags%0A                        foreach($$item in $$tags) {%0A                            if ($$item.Name -eq "not_monitored") {%0A                                $$new_tags += @{"Name"="not_monitored";"Value"="true"}%0A                            } else {%0A                                $$new_tags += @{"Name"=$$item.Name;"Value"=$$item.Value}%0A                            }%0A                        }%0A                        return $$new_tags%0A                    }%0A                    Set-AzureRmResource -ResourceGroupName $$resourceGroup -Name $$azureVM -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $$new_tags -Force %0A            %0A                    # stop vm%0A                    Stop-AzureRmVM -ResourceGroupName $$ResourceGroup -Name $$azureVM -Force%0A                }%0A            }%0A        EOT%0A      + id                      = (known after apply)%0A      + job_schedule            = (known after apply)%0A      + location                = "ukwest"%0A      + log_progress            = true%0A      + log_verbose             = true%0A      + name                    = "stop-vms"%0A      + resource_group_name     = "t2-oasys"%0A      + runbook_type            = "PowerShellWorkflow"%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 7am"] will be created%0A  + resource "azurerm_automation_schedule" "schedules" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + expiry_time             = (known after apply)%0A      + frequency               = "Week"%0A      + id                      = (known after apply)%0A      + interval                = (known after apply)%0A      + name                    = "weekdays 7am"%0A      + resource_group_name     = "t2-oasys"%0A      + start_time              = "2021-07-19T07:00:00Z"%0A      + timezone                = "UTC"%0A      + week_days               = [%0A          + "Friday",%0A          + "Monday",%0A          + "Thursday",%0A          + "Tuesday",%0A          + "Wednesday",%0A        ]%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_schedule.schedules["weekdays 7pm"] will be created%0A  + resource "azurerm_automation_schedule" "schedules" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + expiry_time             = (known after apply)%0A      + frequency               = "Week"%0A      + id                      = (known after apply)%0A      + interval                = (known after apply)%0A      + name                    = "weekdays 7pm"%0A      + resource_group_name     = "t2-oasys"%0A      + start_time              = "2021-07-16T19:00:00Z"%0A      + timezone                = "UTC"%0A      + week_days               = [%0A          + "Friday",%0A          + "Monday",%0A          + "Thursday",%0A          + "Tuesday",%0A          + "Wednesday",%0A        ]%0A    }%0A%0APlan: 8 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan"%0AReleasing state lock. This may take a few moments...%0A
::set-output name=stderr::
::set-output name=exitcode::0
```